#include <stdio.h>
#include <math.h>



int main() {
  int method, counter = 0;
  printf("\nЩо будемо робити ?\n");
  printf("*******************************************\n");
  printf("Запустити програму - 1\n");
  printf("Вийти з програми - 2\n");
  printf("*******************************************\n");
  while(1) {
    if (counter == 0) {
      printf("\nВвести: ");
      scanf("%d", &method);
      counter += 1;
    }
    else {
      printf("\n\nВи можете спробувати ще раз - 1 || вийти з програми - 2\n");
      printf("Ввести: ");
      scanf("%d", &method);
    }
    if (method == 1) {
      float x1, x2, x3, y1, y2, y3, x1_2, x2_2, x3_2, y1_2, y2_2, y3_2, s1, s2;
      printf("\nВведіть координати вершин двох трикутників\n\n");
      //Перший тритник
      printf("***********************************************\n");
      printf("Введіть координати вершин першого трикутника\n\n");
      printf("Введіть x1: ");
      scanf("%f", &x1);
      printf("Введіть y1: ");
      scanf("%f", &y1);
      printf("\nВведіть x2: ");
      scanf("%f", &x2);
      printf("Введіть y2: ");
      scanf("%f", &y2);
      printf("\nВведіть x3: ");
      scanf("%f", &x3);
      printf("Введіть y3: ");
      scanf("%f", &y3);
      // Другий трикутник
      printf("\n***********************************************\n");
      printf("Введіть координати вершин другого трикутника\n\n");
      printf("Введіть x1: ");
      scanf("%f", &x1_2);
      printf("Введіть y1: ");
      scanf("%f", &y1_2);
      printf("\nВведіть x2: ");
      scanf("%f", &x2_2);
      printf("Введіть y2: ");
      scanf("%f", &y2_2);
      printf("\nВведіть x3: ");
      scanf("%f", &x3_2);
      printf("Введіть y3: ");
      scanf("%f", &y3_2);
      // Обчислення
      s1 = 0.5 * ((x1*y2 + x2*y3 + x3*y1) - (y1*x2 + y2*x3 + y3*x1));
      s1 = fabs(s1);
      s2 = 0.5 * ((x1_2*y2_2 + x2_2*y3_2 + x3_2*y1_2) - (y1_2*x2_2 + y2_2*x3_2 + y3_2*x1_2));
      s2 = fabs(s2);
      if (s1 == 0 || s2 == 0) {
        printf("\nВи ввели неправильні координати (неможливо утворити трикутник)");
      }
      else {
        printf("\n*******");
        printf("Результат");
        printf("*******\n");
        printf("\nПлоща першого трикутника S1 = ");
        printf("%.1f\n", s1);
        printf("Площа другого трикутника S2 = ");
        printf("%.1f\n", s2);
        if (s1 > s2) {
          printf("\nПлоща першого трикутника більша");
        }
        else if (s2 > s1) {
          printf("\nПлоща другого трикутника більша");
        }
        else {
          printf("\nПлощі трикутників рівні");
        }
      }
    }
    else {
      break;
    }
  }
  return 0;
}  